Revit 2027 API
BaseImportOptions.ThisViewOnly Property
 Imports drawings into the view that was passed into the import method. This option is not available in 3D views.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ThisViewOnly { get; set; }
Public Property ThisViewOnly As Boolean
	Get
	Set
public:
property bool ThisViewOnly {
	bool get ();
	void set (bool value);
}
member ThisViewOnly : bool with get, set
Property Value
Boolean
See Also
Reference
BaseImportOptions Class
Autodesk.Revit.DB Namespace